Revit 2027 API
IFCUserDefinedPropertySet.GetApplicableEntities Method
 Returns the list of IFC entities to which the property set is applicable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetApplicableEntities()
Public Function GetApplicableEntities As IList(Of String)
public:
IList<String^>^ GetApplicableEntities()
member GetApplicableEntities : unit -> IList<string>
Return Value
IList<String>
 The list of IFC entities to which the property set is applicable.
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace